/**
 * author: wtzhu
 * date: 20200307
 * function: test NixieTube and interrupt
 * e_mail: wtzhu_13@163.com
 * version:
 */

#include <reg52.h>
#include "sysParameter.h"
#include "../delay/timeDebug.h"

int ledNum[16] = {0xc0, 0xf9, 0xa4, 0xb0, 0x99, 0x92, 0x82, 0xf8, 0x80, 0x90, 0x88, 0x83, 0xc6, 0xa1, 0x86, 0x8e};
uint num = 0;
 
/***********************************************************/
/*******************中断初始化程序**************************/
/***********************************************************/

 /**
  * 功能：中断初始化
  * 参数：无
  * 返回值：无
  */
void interruptInit()
{
    TMOD = 0x11;                  // 设置定时器0位工作方式1
    TH0 = (65536 - 45872) / 256;  // 设置定时器初始值
    TL0 = (65536 - 45872) % 256;  
    EA = 1;                       // 开启总中断  
    ET0 = 1;                      // 开启定时器0中断
    TR0 = 1;                      // 启动定时器0
}

/***********************************************************/
/*********************主函数入口****************************/
/***********************************************************/

 /**
  * 功能：主函数入口
  * 参数：无
  * 返回值：无
  */
void main()
{
    uint i = 0;
    interruptInit();
    while (1)
    {       
        P2=0xf0;
        P0 = ledNum[i];
        delay1s();
        i++;
        if (i >= 16)
        {
             i = 0;
        }
//        if (num == 20)
//        {
//            i++;
//            num = 0;               // 时间到了标志位清零
//            if (i >= 16)
//            {
//                i = 0;
//            }
//            
//        }
             
    }   
}

/***********************************************************/
/*********************定时器0中断函数***********************/
/***********************************************************/

 /**
  * 功能：定时器0中断函数
  * 参数：
  * 返回值：
  */
void T0_time() interrupt 1
{
    TH0 = (65536 - 45872) / 256;      // 每次记满后重新设置初始值
    TL0 = (65536 - 45872) % 256;
    num++;                            // 进入一次标志位加1
}