#include <intrins.h>  //包含_nop_()函数定义的头文件
#include "../main/sysParameter.h"
#include "1602Crtl.h"
#include "../delay/timeDebug.h"
#include "../infrared/infrared.h"

/*****************************************************
函数功能：判断液晶模块的忙碌状态
返回值：result。result=1，忙碌;result=0，不忙
***************************************************/
unsigned char BusyTest(void)
{
    bit result;
	RS=0;       //根据规定，RS为低电平，RW为高电平时，可以读状态
    RW=1;
    E=1;        //E=1，才允许读写
    _nop_();   //空操作
    _nop_();
    _nop_(); 
    _nop_();   //空操作四个机器周期，给硬件反应时间	
    result=BF;  //将忙碌标志电平赋给result
	E=0;
    return result;
}

/*****************************************************
函数功能：将模式设置指令或显示地址写入液晶模块
入口参数：dictate
***************************************************/
void WriteInstruction (unsigned char dictate)
{   
     while(BusyTest()==1); //如果忙就等待
	 RS=0;                  //根据规定，RS和R/W同时为低电平时，可以写入指令
	 RW=0;   
	 E=0;                   //E置低电平(根据表8-6，写指令时，E为高脉冲，
                             // 就是让E从0到1发生正跳变，所以应先置"0"
	 _nop_();
	 _nop_();             //空操作两个机器周期，给硬件反应时间
	 P0=dictate;            //将数据送入P0口，即写入指令或地址
	 _nop_();
	 _nop_();
	 _nop_();
	 _nop_();               //空操作四个机器周期，给硬件反应时间
	 E=1;                   //E置高电平
	 _nop_();
	 _nop_();
	 _nop_();
	 _nop_();               //空操作四个机器周期，给硬件反应时间
	  E=0;                  //当E由高电平跳变成低电平时，液晶模块开始执行命令
 }
/*****************************************************
函数功能：指定字符显示的实际地址
入口参数：x
***************************************************/
 void WriteAddress(unsigned char x)
 {
     WriteInstruction(x|0x80); //显示位置的确定方法规定为"80H+地址码x"
 }
/*****************************************************
函数功能：将数据(字符的标准ASCII码)写入液晶模块
入口参数：y(为字符常量)
***************************************************/
 void WriteData(unsigned char y)
 {
    while(BusyTest()==1);  
	  RS=1;           //RS为高电平，RW为低电平时，可以写入数据
	  RW=0;
	  E=0;            //E置低电平(根据表8-6，写指令时，E为高脉冲，
                       // 就是让E从0到1发生正跳变，所以应先置"0"
	  P0=y;           //将数据送入P0口，即将数据写入液晶模块
	  _nop_();
	  _nop_();
 	  _nop_();
      _nop_();       //空操作四个机器周期，给硬件反应时间
	  E=1;          //E置高电平
	  _nop_();
	  _nop_();
	  _nop_();
	  _nop_();        //空操作四个机器周期，给硬件反应时间
	  E=0;            //当E由高电平跳变成低电平时，液晶模块开始执行命令
 }
/*****************************************************
函数功能：对LCD的显示模式进行初始化设置
***************************************************/
void LcdInitiate(void)
{
    delayMS(15);             //延时15ms，首次写指令时应给LCD一段较长的反应时间
    WriteInstruction(0x38);  //显示模式设置：16×2显示，5×7点阵，8位数据接口
	delayMS(5);   //延时5ms　
	WriteInstruction(0x38);
	delayMS(5);
	WriteInstruction(0x38);
	delayMS(5);
	WriteInstruction(0x0E);  //显示模式设置：显示开，有光标，光标闪烁
	delayMS(5);
	WriteInstruction(0x06);  //显示模式设置：光标右移，字符不移
	delayMS(5);
	WriteInstruction(0x01);  //清屏幕指令，将以前的显示内容清除
	delayMS(5);
 }

 /************************************************************
 函数功能：1602LCD显示
 *************************************************************/
 void Disp(uchar *a)
 {	
	   WriteAddress(0x40);  // 设置显示位置为第一行的第1个字
	   two_2_bcd(a[0]);
	   WriteData(0x20);
	   two_2_bcd(a[1]);
	   WriteData(0x20);
	   two_2_bcd(a[2]);
	   WriteData(0x20);
	   two_2_bcd(a[3]);   
 }

